{"class_name": "Model", "config": {"input_layers": [["input_2", 0, 0]], "layers": [{"config": {"batch_input_shape": [null, 32, 32, 3], "name": "input_2", "dtype": "float32", "sparse": false}, "class_name": "InputLayer", "inbound_nodes": [], "name": "input_2"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_1", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "conv2d_1"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_1", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "activation_1"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_2", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_2"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_2", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "activation_2"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_3", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "conv2d_3"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_3", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3"}, {"config": {"trainable": true, "name": "add_1"}, "class_name": "Add", "inbound_nodes": [[["activation_1", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]], "name": "add_1"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation", "inbound_nodes": [[["add_1", 0, 0, {}]]], "name": "activation_3"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_4", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "conv2d_4"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_4", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_4"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "activation_4"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_5", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "conv2d_5"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_5", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_5"}, {"config": {"trainable": true, "name": "add_2"}, "class_name": "Add", "inbound_nodes": [[["activation_3", 0, 0, {}], ["batch_normalization_5", 0, 0, {}]]], "name": "add_2"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "class_name": "Activation", "inbound_nodes": [[["add_2", 0, 0, {}]]], "name": "activation_5"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_6", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "conv2d_6"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_6", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "batch_normalization_6"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "activation_6"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_7", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "conv2d_7"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_7", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "batch_normalization_7"}, {"config": {"trainable": true, "name": "add_3"}, "class_name": "Add", "inbound_nodes": [[["activation_5", 0, 0, {}], ["batch_normalization_7", 0, 0, {}]]], "name": "add_3"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "class_name": "Activation", "inbound_nodes": [[["add_3", 0, 0, {}]]], "name": "activation_7"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_8", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "conv2d_8"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_8", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "batch_normalization_8"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_8"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "name": "activation_8"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_9", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "conv2d_9"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_9", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "batch_normalization_9"}, {"config": {"trainable": true, "name": "add_4"}, "class_name": "Add", "inbound_nodes": [[["activation_7", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]], "name": "add_4"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_9"}, "class_name": "Activation", "inbound_nodes": [[["add_4", 0, 0, {}]]], "name": "activation_9"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_10", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "conv2d_10"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_10", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "batch_normalization_10"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_10"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "activation_10"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_11", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "conv2d_11"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_11", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "batch_normalization_11"}, {"config": {"trainable": true, "name": "add_5"}, "class_name": "Add", "inbound_nodes": [[["activation_9", 0, 0, {}], ["batch_normalization_11", 0, 0, {}]]], "name": "add_5"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_11"}, "class_name": "Activation", "inbound_nodes": [[["add_5", 0, 0, {}]]], "name": "activation_11"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_12", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "name": "conv2d_12"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_12", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "batch_normalization_12"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_12"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "name": "activation_12"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_13", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "name": "conv2d_13"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_13", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "batch_normalization_13"}, {"config": {"trainable": true, "name": "add_6"}, "class_name": "Add", "inbound_nodes": [[["activation_11", 0, 0, {}], ["batch_normalization_13", 0, 0, {}]]], "name": "add_6"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_13"}, "class_name": "Activation", "inbound_nodes": [[["add_6", 0, 0, {}]]], "name": "activation_13"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_14", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "name": "conv2d_14"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_14", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "batch_normalization_14"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_14"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "activation_14"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_15", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "conv2d_15"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_15", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "batch_normalization_15"}, {"config": {"trainable": true, "name": "add_7"}, "class_name": "Add", "inbound_nodes": [[["activation_13", 0, 0, {}], ["batch_normalization_15", 0, 0, {}]]], "name": "add_7"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_15"}, "class_name": "Activation", "inbound_nodes": [[["add_7", 0, 0, {}]]], "name": "activation_15"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_16", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "name": "conv2d_16"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_16", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "batch_normalization_16"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_16"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "name": "activation_16"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_17", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "name": "conv2d_17"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_17", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "batch_normalization_17"}, {"config": {"trainable": true, "name": "add_8"}, "class_name": "Add", "inbound_nodes": [[["activation_15", 0, 0, {}], ["batch_normalization_17", 0, 0, {}]]], "name": "add_8"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_17"}, "class_name": "Activation", "inbound_nodes": [[["add_8", 0, 0, {}]]], "name": "activation_17"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_18", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 15, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "name": "conv2d_18"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_18", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "batch_normalization_18"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_18"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "name": "activation_18"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_19", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "name": "conv2d_19"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_19", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "batch_normalization_19"}, {"config": {"trainable": true, "name": "add_9"}, "class_name": "Add", "inbound_nodes": [[["activation_17", 0, 0, {}], ["batch_normalization_19", 0, 0, {}]]], "name": "add_9"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_19"}, "class_name": "Activation", "inbound_nodes": [[["add_9", 0, 0, {}]]], "name": "activation_19"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_20", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_19", 0, 0, {}]]], "name": "conv2d_20"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_20", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "batch_normalization_20"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_20"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "name": "activation_20"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_21", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_20", 0, 0, {}]]], "name": "conv2d_21"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_21", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "batch_normalization_21"}, {"config": {"trainable": true, "name": "add_10"}, "class_name": "Add", "inbound_nodes": [[["activation_19", 0, 0, {}], ["batch_normalization_21", 0, 0, {}]]], "name": "add_10"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_21"}, "class_name": "Activation", "inbound_nodes": [[["add_10", 0, 0, {}]]], "name": "activation_21"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_22", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "name": "conv2d_22"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_22", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "name": "batch_normalization_22"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_22"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "name": "activation_22"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_23", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "name": "conv2d_23"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_23", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "name": "batch_normalization_23"}, {"config": {"trainable": true, "name": "add_11"}, "class_name": "Add", "inbound_nodes": [[["activation_21", 0, 0, {}], ["batch_normalization_23", 0, 0, {}]]], "name": "add_11"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_23"}, "class_name": "Activation", "inbound_nodes": [[["add_11", 0, 0, {}]]], "name": "activation_23"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_24", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "name": "conv2d_24"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_24", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "name": "batch_normalization_24"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_24"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "name": "activation_24"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_25", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "name": "conv2d_25"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_25", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "name": "batch_normalization_25"}, {"config": {"trainable": true, "name": "add_12"}, "class_name": "Add", "inbound_nodes": [[["activation_23", 0, 0, {}], ["batch_normalization_25", 0, 0, {}]]], "name": "add_12"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_25"}, "class_name": "Activation", "inbound_nodes": [[["add_12", 0, 0, {}]]], "name": "activation_25"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_26", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_25", 0, 0, {}]]], "name": "conv2d_26"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_26", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "name": "batch_normalization_26"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_26"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "name": "activation_26"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_27", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_26", 0, 0, {}]]], "name": "conv2d_27"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_27", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "name": "batch_normalization_27"}, {"config": {"trainable": true, "name": "add_13"}, "class_name": "Add", "inbound_nodes": [[["activation_25", 0, 0, {}], ["batch_normalization_27", 0, 0, {}]]], "name": "add_13"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_27"}, "class_name": "Activation", "inbound_nodes": [[["add_13", 0, 0, {}]]], "name": "activation_27"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_28", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_27", 0, 0, {}]]], "name": "conv2d_28"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_28", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "name": "batch_normalization_28"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_28"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "name": "activation_28"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_29", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "name": "conv2d_29"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_29", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "name": "batch_normalization_29"}, {"config": {"trainable": true, "name": "add_14"}, "class_name": "Add", "inbound_nodes": [[["activation_27", 0, 0, {}], ["batch_normalization_29", 0, 0, {}]]], "name": "add_14"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_29"}, "class_name": "Activation", "inbound_nodes": [[["add_14", 0, 0, {}]]], "name": "activation_29"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_30", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_29", 0, 0, {}]]], "name": "conv2d_30"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_30", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "name": "batch_normalization_30"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_30"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]], "name": "activation_30"}, {"config": {"data_format": "channels_last", "trainable": true, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv2d_31", "bias_regularizer": null, "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1], "kernel_constraint": null, "filters": 16, "strides": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "bias_constraint": null}, "class_name": "Conv2D", "inbound_nodes": [[["activation_30", 0, 0, {}]]], "name": "conv2d_31"}, {"config": {"gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "trainable": true, "center": true, "momentum": 0.99, "name": "batch_normalization_31", "beta_regularizer": null, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "beta_constraint": null}, "class_name": "BatchNormalization", "inbound_nodes": 