{"keras_version": "2.1.2", "class_name": "Model", "backend": "tensorflow", "config": {"output_layers": [["dense_2", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"sparse": false, "name": "input_4", "dtype": "float32", "batch_input_shape": [null, 32, 32, 3]}, "inbound_nodes": [], "name": "input_4"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_1", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 16, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["input_4", 0, 0, {}]]], "name": "conv2d_1"}, {"class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "name": "batch_normalization_56", "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_56"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_56", 0, 0, {}]]], "name": "activation_1"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_2", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 13, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_2"}, {"class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "name": "batch_normalization_57", "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_57"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_57", 0, 0, {}]]], "name": "activation_2"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_3", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 16, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "conv2d_3"}, {"class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "name": "batch_normalization_58", "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_58"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_28"}, "inbound_nodes": [[["activation_1", 0, 0, {}], ["batch_normalization_58", 0, 0, {}]]], "name": "add_28"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "inbound_nodes": [[["add_28", 0, 0, {}]]], "name": "activation_3"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_4", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 10, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "conv2d_4"}, {"class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "name": "batch_normalization_59", "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_59"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_59", 0, 0, {}]]], "name": "activation_4"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_5", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 16, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "conv2d_5"}, {"class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "name": "batch_normalization_60", "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_60"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_29"}, "inbound_nodes": [[["activation_3", 0, 0, {}], ["batch_normalization_60", 0, 0, {}]]], "name": "add_29"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "inbound_nodes": [[["add_29", 0, 0, {}]]], "name": "activation_5"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_6", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 9, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "conv2d_6"}, {"class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "name": "batch_normalization_61", "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "batch_normalization_61"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_61", 0, 0, {}]]], "name": "activation_6"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_7", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 16, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "conv2d_7"}, {"class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "name": "batch_normalization_62", "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "batch_normalization_62"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_30"}, "inbound_nodes": [[["activation_5", 0, 0, {}], ["batch_normalization_62", 0, 0, {}]]], "name": "add_30"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "inbound_nodes": [[["add_30", 0, 0, {}]]], "name": "activation_7"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_8", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 9, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "conv2d_8"}, {"class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "name": "batch_normalization_63", "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "batch_normalization_63"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_63", 0, 0, {}]]], "name": "activation_8"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_9", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 16, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "conv2d_9"}, {"class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "name": "batch_normalization_64", "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "batch_normalization_64"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_31"}, "inbound_nodes": [[["activation_7", 0, 0, {}], ["batch_normalization_64", 0, 0, {}]]], "name": "add_31"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}, "inbound_nodes": [[["add_31", 0, 0, {}]]], "name": "activation_9"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_10", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 5, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "conv2d_10"}, {"class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "name": "batch_normalization_65", "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "batch_normalization_65"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_10", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_65", 0, 0, {}]]], "name": "activation_10"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_11", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 16, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "conv2d_11"}, {"class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "name": "batch_normalization_66", "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "batch_normalization_66"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_32"}, "inbound_nodes": [[["activation_9", 0, 0, {}], ["batch_normalization_66", 0, 0, {}]]], "name": "add_32"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_11", "activation": "relu"}, "inbound_nodes": [[["add_32", 0, 0, {}]]], "name": "activation_11"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_12", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 3, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["activation_11", 0, 0, {}]]], "name": "conv2d_12"}, {"class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "name": "batch_normalization_67", "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "batch_normalization_67"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_12", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_67", 0, 0, {}]]], "name": "activation_12"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_13", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 16, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["activation_12", 0, 0, {}]]], "name": "conv2d_13"}, {"class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "name": "batch_normalization_68", "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "batch_normalization_68"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_33"}, "inbound_nodes": [[["activation_11", 0, 0, {}], ["batch_normalization_68", 0, 0, {}]]], "name": "add_33"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_13", "activation": "relu"}, "inbound_nodes": [[["add_33", 0, 0, {}]]], "name": "activation_13"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_14", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 8, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["activation_13", 0, 0, {}]]], "name": "conv2d_14"}, {"class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "name": "batch_normalization_69", "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "batch_normalization_69"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_14", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_69", 0, 0, {}]]], "name": "activation_14"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_15", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 16, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "conv2d_15"}, {"class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "name": "batch_normalization_70", "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "batch_normalization_70"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_34"}, "inbound_nodes": [[["activation_13", 0, 0, {}], ["batch_normalization_70", 0, 0, {}]]], "name": "add_34"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_15", "activation": "relu"}, "inbound_nodes": [[["add_34", 0, 0, {}]]], "name": "activation_15"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_16", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 5, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["activation_15", 0, 0, {}]]], "name": "conv2d_16"}, {"class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "name": "batch_normalization_71", "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "batch_normalization_71"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_16", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_71", 0, 0, {}]]], "name": "activation_16"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_17", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 16, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["activation_16", 0, 0, {}]]], "name": "conv2d_17"}, {"class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "name": "batch_normalization_72", "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "batch_normalization_72"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_35"}, "inbound_nodes": [[["activation_15", 0, 0, {}], ["batch_normalization_72", 0, 0, {}]]], "name": "add_35"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_17", "activation": "relu"}, "inbound_nodes": [[["add_35", 0, 0, {}]]], "name": "activation_17"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_18", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 12, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["activation_17", 0, 0, {}]]], "name": "conv2d_18"}, {"class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "name": "batch_normalization_73", "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "batch_normalization_73"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_18", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_73", 0, 0, {}]]], "name": "activation_18"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_19", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 16, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["activation_18", 0, 0, {}]]], "name": "conv2d_19"}, {"class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "name": "batch_normalization_74", "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "batch_normalization_74"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_36"}, "inbound_nodes": [[["activation_17", 0, 0, {}], ["batch_normalization_74", 0, 0, {}]]], "name": "add_36"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_19", "activation": "relu"}, "inbound_nodes": [[["add_36", 0, 0, {}]]], "name": "activation_19"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_20", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 24, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [2, 2], "bias_regularizer": null}, "inbound_nodes": [[["activation_19", 0, 0, {}]]], "name": "conv2d_20"}, {"class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "name": "batch_normalization_75", "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "batch_normalization_75"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_20", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_75", 0, 0, {}]]], "name": "activation_20"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_21", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 32, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["activation_20", 0, 0, {}]]], "name": "conv2d_21"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_22", "kernel_size": [1, 1], "activity_regularizer": null, "filters": 32, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [2, 2], "bias_regularizer": null}, "inbound_nodes": [[["activation_19", 0, 0, {}]]], "name": "conv2d_22"}, {"class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "name": "batch_normalization_76", "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "batch_normalization_76"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_37"}, "inbound_nodes": [[["conv2d_22", 0, 0, {}], ["batch_normalization_76", 0, 0, {}]]], "name": "add_37"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_21", "activation": "relu"}, "inbound_nodes": [[["add_37", 0, 0, {}]]], "name": "activation_21"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_23", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 13, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["activation_21", 0, 0, {}]]], "name": "conv2d_23"}, {"class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "name": "batch_normalization_77", "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "name": "batch_normalization_77"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_22", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_77", 0, 0, {}]]], "name": "activation_22"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_24", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 32, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["activation_22", 0, 0, {}]]], "name": "conv2d_24"}, {"class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "name": "batch_normalization_78", "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "name": "batch_normalization_78"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_38"}, "inbound_nodes": [[["activation_21", 0, 0, {}], ["batch_normalization_78", 0, 0, {}]]], "name": "add_38"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_23", "activation": "relu"}, "inbound_nodes": [[["add_38", 0, 0, {}]]], "name": "activation_23"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_25", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 18, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["activation_23", 0, 0, {}]]], "name": "conv2d_25"}, {"class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "name": "batch_normalization_79", "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "name": "batch_normalization_79"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_24", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_79", 0, 0, {}]]], "name": "activation_24"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_26", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 32, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["activation_24", 0, 0, {}]]], "name": "conv2d_26"}, {"class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "name": "batch_normalization_80", "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "name": "batch_normalization_80"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_39"}, "inbound_nodes": [[["activation_23", 0, 0, {}], ["batch_normalization_80", 0, 0, {}]]], "name": "add_39"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_25", "activation": "relu"}, "inbound_nodes": [[["add_39", 0, 0, {}]]], "name": "activation_25"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_27", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 11, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["activation_25", 0, 0, {}]]], "name": "conv2d_27"}, {"class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "name": "batch_normalization_81", "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "name": "batch_normalization_81"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_26", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_81", 0, 0, {}]]], "name": "activation_26"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_28", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 32, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["activation_26", 0, 0, {}]]], "name": "conv2d_28"}, {"class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "name": "batch_normalization_82", "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "name": "batch_normalization_82"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_40"}, "inbound_nodes": [[["activation_25", 0, 0, {}], ["batch_normalization_82", 0, 0, {}]]], "name": "add_40"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_27", "activation": "relu"}, "inbound_nodes": [[["add_40", 0, 0, {}]]], "name": "activation_27"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_29", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 11, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["activation_27", 0, 0, {}]]], "name": "conv2d_29"}, {"class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "name": "batch_normalization_83", "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "name": "batch_normalization_83"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_28", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_83", 0, 0, {}]]], "name": "activation_28"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_30", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 32, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["activation_28", 0, 0, {}]]], "name": "conv2d_30"}, {"class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "name": "batch_normalization_84", "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "name": "batch_normalization_84"}, {"class_name": "Add", "config": {"trainable": true, "name": "add_41"}, "inbound_nodes": [[["activation_27", 0, 0, {}], ["batch_normalization_84", 0, 0, {}]]], "name": "add_41"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_29", "activation": "relu"}, "inbound_nodes": [[["add_41", 0, 0, {}]]], "name": "activation_29"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_31", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 14, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "strides": [1, 1], "bias_regularizer": null}, "inbound_nodes": [[["activation_29", 0, 0, {}]]], "name": "conv2d_31"}, {"class_name": "BatchNormalization", "config": {"trainable": true, "center": true, "name": "batch_normalization_85", "scale": true, "beta_constraint": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "axis": -1}, "inbound_nodes": [[["conv2d_31", 0, 0, {}]]], "name": "batch_normalization_85"}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_30", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_85", 0, 0, {}]]], "name": "activation_30"}, {"class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_32", "kernel_size": [3, 3], "activity_regularizer": null, "filters": 32, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 9.999999747378752e-05}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "padding": "same", "use_bias": true, "dilation_rate": [1, 1], "activation": "linear", "kernel_constraint": null, 